/*
 * Copyright (c) 2011 by KLab Inc., All rights reserved.
 *
 * Programmed by iphoroid team
 */

package org.klab.ui_demo.dao;

import java.io.File;
import java.io.IOException;
import java.util.ArrayList;
import java.util.List;

import android.os.Environment;

import org.klab.ui_demo.model.Item;


/**
 * ItemDao.
 *
 * @author <a href="mailto:kodama-t@klab.jp">Takuya KODAMA</a> (kodamta-t)
 * @author <a href="mailto:sano-n@klab.jp">Naohide Sano</a> (sano-n)
 */
public class ItemDao {

    /** */
    protected ItemDao() {
    }

    /**
     * シングルトン　インスタンス
     */
    private static ItemDao instance = new ItemDao();

    /**
     * シングルトン　インスタンスを返します
     */
    public static ItemDao getInstance() {
        return instance;
    }

    /**
     * 指定された PurchaseStatus に適切なデータのリストを返します.
     */
    public List<Item> getImages() throws IOException {
        List<Item> result = new ArrayList<Item>();
        for (int i = 0; i < 99; i++) {
            result.add(newItem(i));
        }
        return result;
    }

    protected Item newItem(int id) throws IOException {
        Item item = new Item();
        item.setId(id);
        item.setTitle(titles[id]);
        item.setDate(dates[id]);
        item.setImageUrl(new File(String.format("%s/iphoroid/data1/gallery_img%02d.jpg", Environment.getExternalStorageDirectory(), id + 1)).toURL().toString());
        item.setThumbnailUrl(String.format("%s/iphoroid/data1/gallery_img%02d.jpg", Environment.getExternalStorageDirectory(), id + 1));
        return item;
    }

    private static final String[] titles = { 
        "眺める猫",
        "2011年の春",
        "桜はやはりキレイだ",
        "空と花　",
        "散歩の途中に　",
        "散歩の途中に2",
        "涼しげな音につられて",
        "今日の目的地",
        "目の前いっぱいに緑",
        "夏の夜の風物詩",
        "天気が味方してくれた",
        "海とヨット",
        "色使いがなんとも言えない",
        "映画の中にトリップ",
        "夕焼けと橋と向こう側",
        "山あり谷あり続く一本道",
        "タクシーは黄色だけ",
        "魔除けになるらしい",
        "上海ナイト初体験",
        "おとぎの国の乗り物",
        "仙人の住む土地",
        "グラデーションな空",
        "ニモがいっぱい",
        "自然の中で見つけた出会い",
        "wallpaper1",
        "もうすぐ夏がくる",
        "beautiful sunrise",
        "wallpaper2",
        "wallpaper3",
        "wallpaper4",
        "マイナスイオン浴びてきます",
        "登頂者へだけのご褒美",
        "最高の相棒らしい",
        "ハトのたまり場？",
        "京都の夜に花",
        "夜空に燃えて咲く花",
        "また春がやってくる",
        "要チェック！",
        "日本とアメリカ",
        "今日の空",
        "高速道路と晴れ",
        "都会に流れる無数の光",
        "旅立ちの瞬間",
        "毎日お疲れ様です",
        "隙間から見上げる空の色",
        "帰ってくる人々",
        "日本の中心",
        "行き急ぐビジネスマン達",
        "高いビルが増えたな",
        "眩しいと思ったら",
        "窓の形が気になったので",
        "モヤモヤネオン街",
        "夕焼け色に染まる",
        "まるで燃えているようだ",
        "夕日は街全体を包んでいく",
        "だんだんと夜に近づく",
        "家族のような影",
        "ネオンイルミネーション",
        "夜の街",
        "まだ若いみどり",
        "夜に飲まれていく",
        "wallpaper5",
        "wallpaper6",
        "wallpaper7",
        "丘の上から眺める街",
        "海を楽しむ人々",
        "ピーナッツみたいな屋根",
        "夏の海のオアシス",
        "カクテルのような夕焼け",
        "海が見える特等席",
        "カラフルヨット",
        "今から出発のようだ",
        "ここに着地する気か？",
        "青空とまんまる気球",
        "水に花",
        "初めて見るハイビスカス",
        "木陰で最高の時間を",
        "ヤシの木がいっぱい",
        "絵本のような景色",
        "一度見てみたい風景",
        "一度見てみたい風景2",
        "地平線に広がる雲",
        "白と青だけの世界",
        "どこまでも続く大地",
        "お気に入りのショップ",
        "記念日のディナーは",
        "連れていってあげたい場所",
        "アーチをくぐると",
        "ポストカードにしたい一枚",
        "タクシーはやっぱり黄色",
        "憧れのロンドンバス",
        "星条旗とイエロー",
        "観光にいかが？",
        "パレードに参加してみた",
        "ご主人様を待ちわびる",
        "凛と咲き誇る",
        "water ring",
        "黄昏のデート",
        "木漏れ日を浴びながら",
        "日本の春が好き"
    };

    private static final String[] dates = {
        "2012/1/1",
        "2012/1/2",
        "2012/1/3",
        "2012/1/4",
        "2012/1/5",
        "2012/1/6",
        "2012/1/7",
        "2012/1/8",
        "2012/1/9",
        "2012/1/10",
        "2012/1/11",
        "2012/1/12",
        "2012/1/13",
        "2012/1/14",
        "2012/1/15",
        "2012/1/16",
        "2012/1/17",
        "2012/1/18",
        "2012/1/19",
        "2012/1/20",
        "2012/1/21",
        "2012/1/22",
        "2012/1/23",
        "2012/1/24",
        "2012/1/25",
        "2012/1/26",
        "2012/1/27",
        "2012/1/28",
        "2012/1/29",
        "2012/1/30",
        "2012/1/31",
        "2012/2/1",
        "2012/2/2",
        "2012/2/3",
        "2012/2/4",
        "2012/2/5",
        "2012/2/6",
        "2012/2/7",
        "2012/2/8",
        "2012/2/9",
        "2012/2/10",
        "2012/2/11",
        "2012/2/12",
        "2012/2/13",
        "2012/2/14",
        "2012/2/15",
        "2012/2/16",
        "2012/2/17",
        "2012/2/18",
        "2012/2/19",
        "2012/2/20",
        "2012/2/21",
        "2012/2/22",
        "2012/2/23",
        "2012/2/24",
        "2012/2/25",
        "2012/2/26",
        "2012/2/27",
        "2012/2/28",
        "2012/2/29",
        "2012/3/1",
        "2012/3/2",
        "2012/3/3",
        "2012/3/4",
        "2012/3/5",
        "2012/3/6",
        "2012/3/7",
        "2012/3/8",
        "2012/3/9",
        "2012/3/10",
        "2012/3/11",
        "2012/3/12",
        "2012/3/13",
        "2012/3/14",
        "2012/3/15",
        "2012/3/16",
        "2012/3/17",
        "2012/3/18",
        "2012/3/19",
        "2012/3/20",
        "2012/3/21",
        "2012/3/22",
        "2012/3/23",
        "2012/3/24",
        "2012/3/25",
        "2012/3/26",
        "2012/3/27",
        "2012/3/28",
        "2012/3/29",
        "2012/3/30",
        "2012/3/31",
        "2012/4/1",
        "2012/4/2",
        "2012/4/3",
        "2012/4/4",
        "2012/4/5",
        "2012/4/6",
        "2012/4/7",
        "2012/4/8",
        "2012/4/9"
    };
}

/* */
